hiperiondev/esp32idf_APRS/components/webconfig/web_common.c
void web_html_attr_escape(const char *src, char *dst, size_t dst_size) {
    if (!dst || dst_size == 0)
        return;
    size_t di = 0;
    for (const char *p = src; src && *p && di + 1 < dst_size; p++) {
        const char *ent = NULL;
        switch (*p) {
            case '&':
                ent = "&amp;";
                break;
            case '<':
                ent = "&lt;";
                break;
            case '>':
                ent = "&gt;";
                break;
            case '"':
                ent = "&quot;";
                break;
            case '\'':
                ent = "&#39;";
                break;
            default:
                break;
        }
        if (ent) {
            size_t elen = strlen(ent);
            if (di + elen >= dst_size)
                break;
            memcpy(dst + di, ent, elen);
            di += elen;
        } else {
            dst[di++] = *p;
        }
    }
    dst[di] = 0;
}

void web_sanitize_filename(const char *src, char *dst, size_t dst_size) {
    if (!dst || dst_size == 0)
        return;
    dst[0] = 0;
    if (!src)
        return;

    // Some browsers send the full local path for <input type=file>; keep
    // only whatever follows the last separator.
    const char *base = src;
    for (const char *p = src; *p; p++) {
        if (*p == '/' || *p == '\\')
            base = p + 1;
    }

    size_t di = 0;
    for (const char *p = base; *p && di + 1 < dst_size; p++) {
        unsigned char c = (unsigned char)*p;
        dst[di++] = (isalnum(c) || c == '.' || c == '-' || c == '_' || c == ' ') ? (char)c : '_';
    }
    dst[di] = 0;

    // Strip leading dots so "..", ".htaccess"-style, or empty-after-dots
    // names can't happen.
    size_t lead = 0;
    while (dst[lead] == '.')
        lead++;
    if (lead > 0)
        memmove(dst, dst + lead, di - lead + 1);

    if (dst[0] == 0)
        snprintf(dst, dst_size, "upload.bin");
}

// ---------------------------------------------------------------- Multipart upload (streaming)
// See web_common.h for the contract. Implementation notes:
//
// The parser keeps one heap scratch buffer (MP_BUF_CAP bytes) and never
// holds more than that much of the request in RAM at once, regardless of
// how large the uploaded file is - it feeds completed chunks of the file
// part to `cb` as soon as it's sure they aren't a prefix of the closing
// boundary marker, then discards them. This is what lets a multi-hundred-KB
// firmware image stream straight into esp_ota_write() on a device with a
// few hundred KB of free heap.
#define MP_BUF_CAP     4096
#define MP_MAX_HEADER  512
#define MP_MAX_PARTS   32 // sanity cap against a pathological/adversarial body

static const uint8_t *mp_mem_find(const uint8_t *hay, size_t haylen, const char *needle, size_t needlelen) {
    if (needlelen == 0 || haylen < needlelen)
        return NULL;
    for (size_t i = 0; i + needlelen <= haylen; i++) {
        if (memcmp(hay + i, needle, needlelen) == 0)
            return hay + i;
    }
    return NULL;
}

// Case-insensitive substring search (header names/values are case-insensitive).
static const char *mp_ci_strstr(const char *hay, const char *needle) {
    size_t nlen = strlen(needle);
    for (const char *p = hay; *p; p++) {
        if (strncasecmp(p, needle, nlen) == 0)
            return p;
    }
    return NULL;
}

esp_err_t web_multipart_receive_file(httpd_req_t *req, web_multipart_data_cb_t cb, void *cb_ctx, char *filename_out, size_t filename_out_size) {
    if (filename_out && filename_out_size)
        filename_out[0] = 0;

    char ctype[256];
    if (httpd_req_get_hdr_value_str(req, "Content-Type", ctype, sizeof(ctype)) != ESP_OK)
        return ESP_ERR_INVALID_ARG;
    const char *bmark = mp_ci_strstr(ctype, "boundary=");
    if (!bmark)
        return ESP_ERR_INVALID_ARG;
    bmark += 9;

    char boundary[128];
    size_t bi = 0;
    if (*bmark == '"') {
        bmark++;
        while (*bmark && *bmark != '"' && bi + 1 < sizeof(boundary))
            boundary[bi++] = *bmark++;
    } else {
        while (*bmark && *bmark != ';' && *bmark != ' ' && *bmark != '\r' && *bmark != '\n' && bi + 1 < sizeof(boundary))
            boundary[bi++] = *bmark++;
    }
    boundary[bi] = 0;
    if (bi == 0)
        return ESP_ERR_INVALID_ARG;

    char delim[132];
    int delim_len = snprintf(delim, sizeof(delim), "--%s", boundary);
    if (delim_len <= 0 || (size_t)delim_len >= sizeof(delim))
        return ESP_ERR_INVALID_ARG;

    char close_marker[134];
    int close_len = snprintf(close_marker, sizeof(close_marker), "\r\n%s", delim);
    if (close_len <= 0 || (size_t)close_len >= sizeof(close_marker)) {
        return ESP_ERR_INVALID_ARG;
    }

    uint8_t *buf = malloc(MP_BUF_CAP);
    if (!buf)
        return ESP_ERR_NO_MEM;
    size_t buf_len = 0;
    int remaining = (int)req->content_len;
    esp_err_t result = ESP_FAIL;
    bool found_file_part = false;

#define MP_FILL()                                                                                                                                            \
    do {                                                                                                                                                      \
        while (buf_len < MP_BUF_CAP && remaining > 0) {                                                                                                       \
            int want = (int)(MP_BUF_CAP - buf_len);                                                                                                           \
            if (want > remaining)                                                                                                                             \
                want = remaining;                                                                                                                             \
            int r = httpd_req_recv(req, (char *)buf + buf_len, want);                                                                                         \
            if (r > 0) {                                                                                                                                      \
                buf_len += (size_t)r;                                                                                                                         \
                remaining -= r;                                                                                                                               \
            } else if (r == HTTPD_SOCK_ERR_TIMEOUT) {                                                                                                         \
                continue;                                                                                                                                     \
            } else {                                                                                                                                          \
                goto done;                                                                                                                                    \
            }                                                                                                                                                 \
        }                                                                                                                                                     \
    } while (0)

    MP_FILL();

