hiperiondev/esp32idf_APRS/components/webconfig/web_common.c
void web_send_saved_redirect(httpd_req_t *req, const char *location) {
    char buf[256];
    snprintf(buf, sizeof(buf),
             "<!DOCTYPE html><html><head><meta charset='utf-8'>"
             "<meta http-equiv='refresh' content='1;url=%s'></head>"
             "<body>" TR_SAVED_REDIRECT "</body></html>",
             location);
    httpd_resp_set_type(req, "text/html");
    httpd_resp_set_hdr(req, "Cache-Control", "no-store, no-cache, must-revalidate");
    httpd_resp_set_hdr(req, "Pragma", "no-cache");
    httpd_resp_sendstr(req, buf);
}

esp_err_t web_handle_css(httpd_req_t *req) {
    static const char *css =
        // Palette/typography matched to hiperiondev/ESP32_WSPR's embedded web admin
        ":root{--bg:#f5f4f0;--card:#ffffff;--border:#d0cfc9;--accent:#1a56db;"
        "--green:#1a7f37;--red:#cf222e;--text:#1c1c1c;--sub:#57534e;}"
        "*{box-sizing:border-box;margin:0;padding:0;}"
        "body{font-family:'Segoe UI',system-ui,sans-serif;background:var(--bg);color:var(--text);}"
        ".topbar{display:flex;justify-content:space-between;align-items:center;padding:14px 20px;"
        "background:var(--card);border-bottom:1px solid var(--border);}"
        ".topbar .brand{font-weight:700;color:var(--accent);font-size:1.05em;}"
        ".topbar .logout{color:var(--sub);text-decoration:none;font-size:.85em;font-weight:600;}"
        ".topbar .logout:hover{color:var(--red);}"
        ".layout{display:flex;min-height:calc(100vh - 52px);}"
        ".sidebar{width:210px;background:var(--card);border-right:1px solid var(--border);padding:12px 0;}"
        ".sidebar ul{list-style:none;}"
        ".sidebar li a{display:block;padding:10px 18px;color:var(--text);text-decoration:none;"
        "font-size:.85em;border-left:3px solid transparent;transition:.15s;}"
        ".sidebar li a:hover{background:var(--bg);border-left-color:var(--border);}"
        ".sidebar li a.active{background:#eef2ff;color:var(--accent);font-weight:700;border-left-color:var(--accent);}"
        ".content{flex:1;padding:24px 28px;max-width:900px;}"
        "h1{color:var(--accent);font-size:1.4em;border-bottom:1px solid var(--border);padding-bottom:10px;margin-bottom:16px;}"
        "fieldset{background:var(--card);border:1px solid var(--border);border-radius:10px;"
        "margin-bottom:16px;padding:18px 20px;}"
        "legend{color:var(--accent);padding:0 8px;font-size:.85em;font-weight:700;}"
        "label{display:block;color:var(--sub);font-size:.8em;margin:12px 0 4px;}"
        "label:first-child{margin-top:0;}"
        "p label{display:inline;}"
        ".pwd-show{display:block;font-size:.72em;font-weight:400;margin:4px 0 0;color:var(--sub);}"
        "input[type=text],input[type=password],input[type=number],select,textarea{"
        "width:100%;padding:8px 10px;border:1px solid var(--border);border-radius:6px;"
        "background:var(--bg);color:var(--text);font-size:.9em;outline:none;transition:.2s;}"
        "input:focus,select:focus,textarea:focus{border-color:var(--accent);}"
        "input[type=checkbox]{width:16px;height:16px;cursor:pointer;accent-color:var(--accent);margin-right:6px;}"
        ".row{display:flex;gap:16px;flex-wrap:wrap;}"
        ".row>div{flex:1;min-width:160px;}"
        "button,.btn{background:#b2f0e8;color:#0d4a42;border:0;border-radius:6px;"
        "padding:10px 20px;font-weight:700;cursor:pointer;font-size:.9em;text-decoration:none;"
        "display:inline-block;margin-top:10px;transition:.2s;}"
        "button:hover,.btn:hover{background:#89e6d8;}"
        "button.secondary,.btn.secondary{background:#e8e7e3;color:var(--sub);}"
        "button.secondary:hover,.btn.secondary:hover{background:#dddcda;}"
        "button.danger,.btn.danger{background:#fff0f0;color:var(--red);border:1px solid var(--red);}"
        "button.danger:hover,.btn.danger:hover{background:var(--red);color:#fff;}"
        "table{border-collapse:collapse;width:100%;font-size:.82em;}"
        "table th,table td{border:1px solid var(--border);padding:7px 9px;text-align:left;}"
        "table th{background:var(--bg);color:var(--sub);}"
        ".login-box{max-width:340px;margin:80px auto;background:var(--card);padding:28px;"
        "border-radius:10px;border:1px solid var(--border);}"
        ".login-box h1{border:0;text-align:center;}"
        ".msg-ok{color:var(--green);} .msg-err{color:var(--red);}"
        ".badge{display:inline-block;padding:2px 8px;border-radius:10px;font-size:.75em;font-weight:700;}"
        ".badge.ok{background:#d1fae5;color:var(--green);}"
        ".badge.warn{background:#fef3c7;color:#92400e;}"
        ".badge.err{background:#fee2e2;color:var(--red);}"
        ".traffic-actions{display:flex;gap:8px;margin-bottom:10px;}"
        ".traffic-actions .btn{margin-top:0;padding:6px 12px;font-size:.8em;}"
        ".traffic-table-wrap{max-height:360px;overflow-y:auto;}"
        "#trafficTable td{font-family:'Consolas','Courier New',monospace;font-size:.95em;"
        "white-space:nowrap;overflow:hidden;text-overflow:ellipsis;max-width:340px;}"
        "#trafficTable th:nth-child(4),#trafficTable td:nth-child(4){max-width:420px;}"
        ".chat-box{max-height:440px;min-height:200px;overflow-y:auto;display:flex;flex-direction:column;"
        "gap:8px;padding:10px;background:var(--bg);border:1px solid var(--border);border-radius:8px;}"
        ".chat-empty{color:var(--sub);font-size:.85em;text-align:center;padding:20px 0;}"
        ".chat-bubble{max-width:78%;padding:8px 12px;border-radius:12px;font-size:.85em;word-break:break-word;}"
        ".chat-bubble .chat-meta{display:block;font-size:.75em;opacity:.7;margin-bottom:3px;}"
        ".chat-bubble.rx{align-self:flex-start;background:#e8e7e3;color:var(--text);border-bottom-left-radius:2px;}"
        ".chat-bubble.tx{align-self:flex-end;background:var(--accent);color:#fff;border-bottom-right-radius:2px;}"
        ".chat-bubble.tx.pending{background:#7d9be8;}"
        ".chat-compose{margin-top:14px;}"
        ".chat-compose .row{align-items:flex-start;}"
        ".chat-counter{font-size:.72em;color:var(--sub);text-align:right;margin-top:2px;}"
        "#msgChatStatus{font-size:.8em;margin-top:8px;display:block;}"
        // Collapsible analog-channel accordion (Telemetry page): one card per
        // channel, header always visible (tag + name + live value + caret),
        // body only rendered for the currently-open channel.
        ".faint{color:var(--sub);opacity:.8;}"
        ".achan{border:1px solid var(--border);border-radius:8px;margin-bottom:10px;overflow:hidden;background:var(--bg);}"
        ".achan:last-child{margin-bottom:0;}"
        ".achan-head{display:flex;align-items:center;gap:10px;padding:11px 12px;cursor:pointer;user-select:none;min-height:40px;}"
        ".achan-head .achan-tag{font-weight:700;color:var(--accent);font-size:.9em;width:28px;flex:none;}"
        ".achan-head .achan-name{flex:1;color:var(--text);font-size:.9em;min-width:0;overflow:hidden;text-overflow:ellipsis;white-space:nowrap;}"
        ".achan-head .achan-val{font-variant-numeric:tabular-nums;color:#92400e;font-size:.9em;min-width:70px;text-align:right;flex:none;}"
        ".achan-head .achan-caret{color:var(--sub);font-size:10px;transition:transform .15s;flex:none;}"
        ".achan.open .achan-caret{transform:rotate(90deg);}"
        ".achan-body{display:none;padding:14px;border-top:1px solid var(--border);background:var(--card);}"
        ".achan.open .achan-body{display:block;}"
        ".eqn-preview{margin-top:6px;font-size:.85em;color:var(--sub);background:var(--bg);"
        "border:1px solid var(--border);border-radius:6px;padding:6px 8px;}"
        ".eqn-preview b{color:var(--accent);}"
        "@media (max-width:420px){.achan-head{flex-wrap:wrap;row-gap:4px;}.achan-head .achan-name{flex-basis:100%;order:3;white-space:normal;}}";
    httpd_resp_set_type(req, "text/css");
    return httpd_resp_sendstr(req, css);
}

// ---------------------------------------------------------------- Field helpers
void web_raw(httpd_req_t *req, const char *html) {
    httpd_resp_sendstr_chunk(req, html);
}

void web_fieldset_open(httpd_req_t *req, const char *legend) {
    char buf[160];
    snprintf(buf, sizeof(buf), "<fieldset><legend>%.100s</legend>", legend);
    httpd_resp_sendstr_chunk(req, buf);
}

