hiperiondev/esp32idf_APRS/components/webconfig/web_common.c
void web_fieldset_close(httpd_req_t *req) {
    httpd_resp_sendstr_chunk(req, "</fieldset>");
}

// Both helpers below render arbitrary, saved user/attacker text (e.g.
// free-text comments, or a WiFi SSID copied from an over-the-air scan
// result) back into an HTML attribute on every GET of the owning page. That
// text is HTML-escaped here, once, so no caller has to remember to do it:
// escaping at only some call sites would let a quote/angle-bracket character
// in a comment, status, filter, hostname or WiFi SSID field break out of
// value='...' and inject markup/script that then ran in the admin's
// authenticated session on the next page load.
void web_field_text(httpd_req_t *req, const char *label, const char *name, const char *value, int maxlen) {
    char esc[512];
    web_html_attr_escape(value ? value : "", esc, sizeof(esc));
    char buf[600];
    snprintf(buf, sizeof(buf), "<label>%.60s</label><input type='text' name='%.30s' value='%.400s' maxlength='%d'>", label, name, esc, maxlen);
    httpd_resp_sendstr_chunk(req, buf);
}

void web_field_password(httpd_req_t *req, const char *label, const char *name, const char *value, int maxlen) {
    char esc[512];
    web_html_attr_escape(value ? value : "", esc, sizeof(esc));
    char buf[900];
    snprintf(buf, sizeof(buf),
             "<label>%.60s</label>"
             "<input type='password' name='%.30s' id='pwd_%.30s' value='%.400s' maxlength='%d'>"
             "<label class='pwd-show'><input type='checkbox' onclick=\"togglePwd('pwd_%.30s',this)\"> " TR_SHOW_PASSWORD "</label>",
             label, name, name, esc, maxlen, name);
    httpd_resp_sendstr_chunk(req, buf);
}

void web_field_int(httpd_req_t *req, const char *label, const char *name, long value) {
    char buf[220];
    snprintf(buf, sizeof(buf), "<label>%.60s</label><input type='number' name='%.30s' value='%ld'>", label, name, value);
    httpd_resp_sendstr_chunk(req, buf);
}

void web_field_float(httpd_req_t *req, const char *label, const char *name, float value, const char *step) {
    char buf[240];
    snprintf(buf, sizeof(buf), "<label>%.60s</label><input type='number' step='%.10s' name='%.30s' value='%g'>", label, step ? step : "0.01", name,
             (double)value);
    httpd_resp_sendstr_chunk(req, buf);
}

void web_field_checkbox(httpd_req_t *req, const char *label, const char *name, bool checked) {
    char buf[220];
    snprintf(buf, sizeof(buf), "<label><input type='checkbox' name='%.30s' %s> %.60s</label>", name, checked ? "checked" : "", label);
    httpd_resp_sendstr_chunk(req, buf);
}

void web_field_path_checkboxes(httpd_req_t *req, const char *name_prefix, uint8_t mask) {
    char buf[160];
    snprintf(buf, sizeof(buf), "<label>%s</label>", TR_F_PATH);
    httpd_resp_sendstr_chunk(req, buf);

    char aliases[4][72];
    app_config_lock();
    for (int i = 0; i < 4; i++) {
        strncpy(aliases[i], g_config.path[i], sizeof(aliases[i]) - 1);
        aliases[i][sizeof(aliases[i]) - 1] = 0;
    }
    app_config_unlock();

    for (int k = 0; k < 4; k++) {
        // Sized to hold the escaped alias plus the "Path N (...)" wrapper so
        // the ESP-IDF -Wformat-truncation error cannot fire; the checkbox
        // helper caps the displayed label length itself.
        char plabel[72 * 6 + 32];
        if (aliases[k][0]) {
            char pesc[72 * 6 + 1];
            web_html_attr_escape(aliases[k], pesc, sizeof(pesc));
            snprintf(plabel, sizeof(plabel), TR_F_OBJITEM_PATH_FMT " (%s)", k + 1, pesc);
        } else {
            snprintf(plabel, sizeof(plabel), TR_F_OBJITEM_PATH_FMT, k + 1);
        }
        char name[48];
        snprintf(name, sizeof(name), "%.30s%d", name_prefix, k + 1);
        web_field_checkbox(req, plabel, name, (mask & (1u << k)) != 0);
    }
}

uint8_t web_form_get_path_mask(const char *body, const char *name_prefix) {
    uint8_t mask = 0;
    for (int k = 0; k < 4; k++) {
        char name[48];
        snprintf(name, sizeof(name), "%.30s%d", name_prefix, k + 1);
        if (web_form_get_bool(body, name))
            mask |= (uint8_t)(1u << k);
    }
    return mask;
}

void web_select_open(httpd_req_t *req, const char *label, const char *name) {
    char buf[160];
    snprintf(buf, sizeof(buf), "<label>%.60s</label><select name='%.30s'>", label, name);
    httpd_resp_sendstr_chunk(req, buf);
}

void web_select_option(httpd_req_t *req, int value, const char *label, bool selected) {
    web_select_option_state(req, value, label, selected, false);
}

void web_select_option_state(httpd_req_t *req, int value, const char *label, bool selected, bool disabled) {
    char buf[400];
    snprintf(buf, sizeof(buf), "<option value='%d' %s %s>%.300s</option>", value, selected ? "selected" : "", disabled ? "disabled" : "",
             label);
    httpd_resp_sendstr_chunk(req, buf);
}

void web_select_close(httpd_req_t *req) {
    httpd_resp_sendstr_chunk(req, "</select>");
}

// ---------------------------------------------------------------- GPIO registry
// Every GPIO field g_config currently has, grouped by the feature that owns
// it. This is the ONLY place that mapping lives - a page's GPIO <select>
// never has to know about another page's fields directly, it just asks this
// registry (via web_gpio_owner_tag()) whether a given pin is free.
//
// Entries whose feature has an on/off toggle are only reported while that
// toggle is enabled (a disabled feature doesn't really "hold" its pin); the
// always-on RF module / audio path / message alarm pins, and the BMP180's
// compile-time-fixed I2C pins, are reported unconditionally.
int web_gpio_collect_used(const char *skip_tag, web_gpio_owner_t *out, int max) {
    int n = 0;

#define WEB_GPIO_ADD(gpio_value, owner_tag)                                                                                       \
    do {                                                                                                                          \
        int8_t _g = (int8_t)(gpio_value);                                                                                         \
        if (n < max && _g >= 0 && (!skip_tag || strcmp((owner_tag), skip_tag) != 0)) {                                            \
            out[n].gpio = _g;                                                                                                     \
            out[n].tag = (owner_tag);                                                                                             \
            n++;                                                                                                                  \
        }                                                                                                                         \
    } while (0)

