hiperiondev/esp32idf_APRS/components/webconfig/web_common.c
    // msg_alarm_gpio can hold a real pin number even while the Message Alarm
    // "Enable" checkbox is off (Save doesn't clear it, so re-enabling later
    // keeps the same pin) - only count it as reserved while actually enabled.
    if (g_config.msg_alarm_enable)
        WEB_GPIO_ADD(g_config.msg_alarm_gpio, "Message Alarm");

    // Audio front-end and PTT: all fixed at compile time
    // (esp32idf_radioamateur_modem_config.h / the top-level CMakeLists.txt),
    // always reserved - the modem's ADC/DAC/PTT trio is hardwired on the
    // board. PTT is a compile-time constant like its ADC/DAC siblings and is
    // reported the same way they are - always shown as "used" here so it
    // correctly greys out in every other GPIO picker (e.g. Message Alarm)
    // even though it has no web-admin field of its own.
    WEB_GPIO_ADD(MODEM_ADC_GPIO, "Radio Modem");
    WEB_GPIO_ADD(MODEM_DAC_GPIO, "Radio Modem");
    WEB_GPIO_ADD(MODEM_PTT_GPIO, "PTT");

    // BMP180 I2C bus: fixed at compile time (BMP180.h), always reserved
    // regardless of any run-time enable flag.
    WEB_GPIO_ADD(BMP180_I2C_SDA_GPIO, "BMP180 I2C");
    WEB_GPIO_ADD(BMP180_I2C_SCL_GPIO, "BMP180 I2C");

#undef WEB_GPIO_ADD
    return n;
}

const char *web_gpio_owner_tag(int gpio, const char *skip_tag) {
    web_gpio_owner_t used[WEB_GPIO_MAX_OWNERS];
    int n = web_gpio_collect_used(skip_tag, used, WEB_GPIO_MAX_OWNERS);
    for (int i = 0; i < n; i++) {
        if (used[i].gpio == gpio)
            return used[i].tag;
    }
    return NULL;
}

// ---------------------------------------------------------------- Symbol picker
void web_field_symbol(httpd_req_t *req, const char *label, const char *name_prefix, const char *sym2) {
    char table_ch[2] = { (sym2 && sym2[0]) ? sym2[0] : '/', 0 };
    char sym_ch[2] = { (sym2 && sym2[1]) ? sym2[1] : '&', 0 };
    int table_num = (table_ch[0] == '\\') ? 2 : 1;
    int code_num = (int)(unsigned char)sym_ch[0];

    char ids[64];
    snprintf(ids, sizeof(ids), "%.30sTable", name_prefix);
    char idc[64];
    snprintf(idc, sizeof(idc), "%.30sCode", name_prefix);

    char buf[1600];
    snprintf(buf, sizeof(buf),
             "<label>%.60s</label>"
             "<div style='display:flex;gap:6px;align-items:center'>"
             "<span id='%.30s_icn' style='display:inline-flex;align-items:center;justify-content:center;width:34px;height:34px;"
             "border-radius:6px;background:#dcfce7;overflow:hidden;flex:none'>"
             "<img id='%.30s_img' src='http://aprs.dprns.com/symbols/icons/%d-%d.png' width=32 height=32 style='display:block' "
             "onerror=\"this.style.display='none'\">"
             "</span>"
             "<span style='font-size:12px;color:var(--sub)'>%.60s:</span>"
             "<input type='text' id='%.30s' name='%.30s' value='%.4s' maxlength='1' style='width:3em;text-align:center' "
             "oninput=\"aprsSymUpd('%.30s','%.30s')\">"
             "<span style='font-size:12px;color:var(--sub)'>%.60s:</span>"
             "<input type='text' id='%.30s' name='%.30s' value='%.4s' maxlength='1' style='width:3em;text-align:center' "
             "oninput=\"aprsSymUpd('%.30s','%.30s')\">"
             "<a href='/symbol' target='_blank' title='%.60s' class='secondary' style='text-decoration:none;padding:4px 8px'>%.60s</a>"
             "</div>",
             label, name_prefix, name_prefix, code_num, table_num, TR_F_SYMBOL_TABLE, ids, ids, table_ch, ids, idc,
             TR_F_SYMBOL_CODE, idc, idc, sym_ch, ids, idc, TR_SYM_PICK_HINT, TR_BTN_PICK_SYMBOL);
    httpd_resp_sendstr_chunk(req, buf);

    // Tiny helper script: updates the graphical icon live as the user edits
    // the Table/Code inputs, without waiting for a page reload. Safe to emit
    // once per field; browsers just redefine the same function identically.
    static const char *script =
        "<script>function aprsSymUpd(t,c){"
        "var tv=(document.getElementById(t).value||'/').charAt(0)||'/';"
        "var cv=(document.getElementById(c).value||' ').charAt(0)||' ';"
        "var tn=(tv=='\\\\')?2:1;var cn=cv.charCodeAt(0);"
        "var pfx=t.slice(0,-5);"
        "var img=document.getElementById(pfx+'_img');"
        "if(img){img.style.display='block';img.src='http://aprs.dprns.com/symbols/icons/'+cn+'-'+tn+'.png';}"
        "}</script>";
    httpd_resp_sendstr_chunk(req, script);
}

void web_form_get_symbol(const char *body, const char *name_prefix, const char *legacy_name, char *out, size_t out_size) {
    if (!out || out_size < 3)
        return;

    char name_t[40], name_c[40];
    snprintf(name_t, sizeof(name_t), "%.30sTable", name_prefix);
    snprintf(name_c, sizeof(name_c), "%.30sCode", name_prefix);

    char t[4] = { 0 }, s[4] = { 0 };
    bool got_t = web_form_get(body, name_t, t, sizeof(t));
    bool got_s = web_form_get(body, name_c, s, sizeof(s));
    if (got_t || got_s) {
        out[0] = t[0] ? t[0] : '/';
        out[1] = s[0] ? s[0] : '&';
        out[2] = 0;
        return;
    }

    char legacy[4] = { 0 };
    if (legacy_name && web_form_get(body, legacy_name, legacy, sizeof(legacy)))
        web_form_get(body, legacy_name, out, out_size);
}

void web_field_use_station_data(httpd_req_t *req, const char *checkbox_name, bool checked, const char *call_name, const char *lat_name,
                                 const char *lon_name, const char *alt_name) {
    // Build each field's `document.querySelector(...)` expression (or the
    // literal "null" if the page doesn't have that field), then splice all
    // four into the script below in one go.
    char qcall[80] = "null", qlat[80] = "null", qlon[80] = "null", qalt[80] = "null";
    if (call_name)
        snprintf(qcall, sizeof(qcall), "document.querySelector(\"[name='%.30s']\")", call_name);
    if (lat_name)
        snprintf(qlat, sizeof(qlat), "document.querySelector(\"[name='%.30s']\")", lat_name);
    if (lon_name)
        snprintf(qlon, sizeof(qlon), "document.querySelector(\"[name='%.30s']\")", lon_name);
    if (alt_name)
        snprintf(qalt, sizeof(qalt), "document.querySelector(\"[name='%.30s']\")", alt_name);

    // Callsigns only ever contain [A-Z0-9-], so a plain copy into a JS
    // single-quoted string literal is safe here (no escaping needed), unlike
    // arbitrary free-text user input.
    char buf[2200];
    snprintf(buf, sizeof(buf),
             "<label><input type='checkbox' name='%.30s' id='%.30s' %s> " TR_USE_MY_STATION_DATA "</label>"
             "<script>(function(){"
             "function apply(){"
             "var cb=document.getElementById('%.30s');if(!cb)return;"
             "var on=cb.checked;"
             "var call=%s,lat=%s,lon=%s,alt=%s;"
             "if(call){if(on)call.value='%.9s';call.disabled=on;}"
             "if(lat){if(on)lat.value='%g';lat.disabled=on;}"
             "if(lon){if(on)lon.value='%g';lon.disabled=on;}"
             "if(alt){if(on)alt.value='%g';alt.disabled=on;}"
             "}"
             "document.addEventListener('DOMContentLoaded',function(){"
             "var cb=document.getElementById('%.30s');if(cb){cb.addEventListener('change',apply);apply();}"
             "});"
             "})();</script>",
             checkbox_name, checkbox_name, checked ? "checked" : "", checkbox_name, qcall, qlat, qlon, qalt, g_config.my_callsign,
             (double)g_config.my_lat, (double)g_config.my_lon, (double)g_config.my_alt, checkbox_name);
    httpd_resp_sendstr_chunk(req, buf);
}
